---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
TransactWithCentralOptions Properties
TransactWithCentralOptions Class See Also Send Feedback
---

The TransactWithCentralOptions type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

TransactWithCentralOptions Class

Autodesk.Revit.DB Namespace